'number' + 3 + 3
// Результат: 'number33'
// Пояснення: Перше додавання конкатенує рядок 'number' і число 3, отримуючи 'number3', потім в результаті другого додавання рядок 'number3' конкатенується з числом 3, отримуючи 'number33'.

null + 3
// Результат: 3
// Пояснення: null перетворюється в 0, отримуючи результат 0 + 3, що дорівнює 3.

5 && "qwerty"
// Результат: 'qwerty'
// Пояснення: Обидва операнди перетворюються в true, тому результат виразу є значенням другого операнда, тобто 'qwerty'.

+'40' + +'2' + "hillel";
// Результат: '42hillel'
// Пояснення: Унарні плюси перетворюють рядки '40' і '2' в числа 40 і 2 відповідно, потім вони додаються, отримуючи 42, який конкатенується з рядком 'hillel'.

'10' - 5 === 6;
// Результат: false
// Пояснення: Рядок '10' перетворюється в число 10, яке віднімається від 5, отримуючи 5, яке порівнюється з числом 6, результат порівняння є false.

true + false
// Результат: 1
// Пояснення: true перетворюється в число 1, false перетворюється в 0, вони додаються, отримуючи 1.

'4px' - 3
// Результат: NaN
// Пояснення: Перше значення не може бути конвертовано в число, тому в результаті отримуємо NaN.

'4' - 3
// Результат: 1
// Пояснення: Рядок '4' перетворюється в число 4, яке віднімається від 3, отримуючи 1.

'6' + 3 ** 0;
//Результат: '61'
// Пояснення: Рядок '6' конкатенується з результатом виразу 3 ** 0, який дорівнює 1, отримуючи '61'.

12 / '6'
// Результат: 2
// Пояснення: Рядок '6' перетворюється в число 6, потім 12 ділиться на 6, отримуючи 2.

'10' + (5 === 6);
// Результат: '10false'
// Пояснення: Вираз (5 === 6) повертає false, яке конкатенується з рядком '10', отримуючи '10false'.

null == ''
// Результат: false
// Пояснення: Порівнюється null з пустим рядком, вони не рівні, тому результат є false.

3 ** (9 / 3);
// Результат: 27
// Пояснення: Спочатку обчислюється 9 / 3, отримуючи 3, потім 3 підноситься до степеня 3, отримуючи 27.

!!'false' == !!'true'
// Результат: true
// Пояснення: Обидва рядки перетворюються в логічне значення true, тому їх результати порівнюються, що дає true.

0 || '0' && 1
// Результат: 1
// Пояснення: Спочатку обчислюється '0' && 1, отримуючи 1, потім обчислюється 0 || 1, отримуючи 1.

(+null == false) < 1;
// Результат: true
// Пояснення: null перетворюється в 0, false перетворюється в 0, результати порівнюються, що дає true.

false && true || true
// Результат: true
// Пояснення: false && true перетворюється в false, false || true перетворюється в true.

false && (false || true);
// Результат: false
// Пояснення: false || true перетворюється в true, false && true перетворюється в false.

(+null == false) < 1 ** 5;
// Результат: true
// Пояснення: null перетворюється в 0, false перетворюється в 0, порівнюються, що дає true, але цей результат менше за 1 ** 5, тобто 1, тому результат є true.
